weifengdq/embedded/tc397/tc397_sdmmc/Libraries/iLLD/TC3xx/Tricore/_PinMap/TC39xB/IfxGtm_PinMap_TC39xB_LFBGA292.c
IfxGtm_Tim_TinMap IfxGtm_TIM2_4_P20_3_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_4, {&MODULE_P20, 3}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM2_4_P21_0_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_4, {&MODULE_P21, 0}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM2_4_P34_2_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_4, {&MODULE_P34, 2}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM2_5_P00_6_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_5, {&MODULE_P00, 6}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM2_5_P01_6_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_5, {&MODULE_P01, 6}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM2_5_P11_10_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_5, {&MODULE_P11,10}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM2_5_P11_8_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_5, {&MODULE_P11, 8}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM2_5_P13_0_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_5, {&MODULE_P13, 0}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM2_5_P15_2_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_5, {&MODULE_P15, 2}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM2_5_P20_9_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_5, {&MODULE_P20, 9}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM2_5_P21_1_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_5, {&MODULE_P21, 1}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM2_5_P34_3_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_5, {&MODULE_P34, 3}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM2_6_P00_7_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_6, {&MODULE_P00, 7}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM2_6_P11_11_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_6, {&MODULE_P11,11}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM2_6_P11_13_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_6, {&MODULE_P11,13}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM2_6_P13_1_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_6, {&MODULE_P13, 1}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM2_6_P15_3_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_6, {&MODULE_P15, 3}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM2_6_P20_10_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_6, {&MODULE_P20,10}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM2_6_P20_6_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_6, {&MODULE_P20, 6}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM2_6_P22_6_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_6, {&MODULE_P22, 6}, (IfxGtm_ChXSel)14};
IfxGtm_Tim_TinMap IfxGtm_TIM2_6_P34_4_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_6, {&MODULE_P34, 4}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM2_7_P00_8_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_7, {&MODULE_P00, 8}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM2_7_P01_7_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_7, {&MODULE_P01, 7}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM2_7_P11_12_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_7, {&MODULE_P11,12}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM2_7_P11_14_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_7, {&MODULE_P11,14}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM2_7_P13_2_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_7, {&MODULE_P13, 2}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM2_7_P15_4_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_7, {&MODULE_P15, 4}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM2_7_P20_11_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_7, {&MODULE_P20,11}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM2_7_P20_7_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_7, {&MODULE_P20, 7}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM2_7_P34_5_IN = {IfxGtm_Tim_2, IfxGtm_Tim_Ch_7, {&MODULE_P34, 5}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM3_0_P00_0_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_0, {&MODULE_P00, 0}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM3_0_P00_5_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_0, {&MODULE_P00, 5}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM3_0_P02_6_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_0, {&MODULE_P02, 6}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM3_0_P02_8_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_0, {&MODULE_P02, 8}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM3_0_P11_11_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_0, {&MODULE_P11,11}, (IfxGtm_ChXSel)14};
IfxGtm_Tim_TinMap IfxGtm_TIM3_0_P12_0_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_0, {&MODULE_P12, 0}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM3_0_P13_3_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_0, {&MODULE_P13, 3}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM3_0_P15_5_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_0, {&MODULE_P15, 5}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM3_0_P20_12_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_0, {&MODULE_P20,12}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM3_0_P22_4_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_0, {&MODULE_P22, 4}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM3_0_P33_0_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_0, {&MODULE_P33, 0}, (IfxGtm_ChXSel)13};
IfxGtm_Tim_TinMap IfxGtm_TIM3_0_P33_12_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_0, {&MODULE_P33,12}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM3_1_P00_1_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_1, {&MODULE_P00, 1}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM3_1_P00_2_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_1, {&MODULE_P00, 2}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM3_1_P00_6_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_1, {&MODULE_P00, 6}, (IfxGtm_ChXSel)14};
IfxGtm_Tim_TinMap IfxGtm_TIM3_1_P02_7_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_1, {&MODULE_P02, 7}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM3_1_P11_2_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_1, {&MODULE_P11, 2}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM3_1_P12_1_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_1, {&MODULE_P12, 1}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM3_1_P20_13_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_1, {&MODULE_P20,13}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM3_1_P22_5_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_1, {&MODULE_P22, 5}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM3_1_P33_13_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_1, {&MODULE_P33,13}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM3_1_P33_1_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_1, {&MODULE_P33, 1}, (IfxGtm_ChXSel)15};
IfxGtm_Tim_TinMap IfxGtm_TIM3_2_P00_3_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_2, {&MODULE_P00, 3}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM3_2_P00_7_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_2, {&MODULE_P00, 7}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM3_2_P02_8_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_2, {&MODULE_P02, 8}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM3_2_P11_3_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_2, {&MODULE_P11, 3}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM3_2_P14_8_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_2, {&MODULE_P14, 8}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM3_2_P20_14_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_2, {&MODULE_P20,14}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM3_2_P22_6_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_2, {&MODULE_P22, 6}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM3_2_P32_0_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_2, {&MODULE_P32, 0}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM3_2_P33_2_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_2, {&MODULE_P33, 2}, (IfxGtm_ChXSel)14};
IfxGtm_Tim_TinMap IfxGtm_TIM3_3_P00_4_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_3, {&MODULE_P00, 4}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM3_3_P00_8_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_3, {&MODULE_P00, 8}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM3_3_P02_9_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_3, {&MODULE_P02, 9}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM3_3_P11_6_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_3, {&MODULE_P11, 6}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM3_3_P14_9_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_3, {&MODULE_P14, 9}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM3_3_P15_0_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_3, {&MODULE_P15, 0}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM3_3_P20_1_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_3, {&MODULE_P20, 1}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM3_3_P22_7_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_3, {&MODULE_P22, 7}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM3_3_P32_1_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_3, {&MODULE_P32, 1}, (IfxGtm_ChXSel)15};
IfxGtm_Tim_TinMap IfxGtm_TIM3_3_P33_3_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_3, {&MODULE_P33, 3}, (IfxGtm_ChXSel)12};
IfxGtm_Tim_TinMap IfxGtm_TIM3_4_P00_5_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_4, {&MODULE_P00, 5}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM3_4_P02_10_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_4, {&MODULE_P02,10}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM3_4_P11_9_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_4, {&MODULE_P11, 9}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM3_4_P14_10_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_4, {&MODULE_P14,10}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM3_4_P15_1_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_4, {&MODULE_P15, 1}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM3_4_P20_3_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_4, {&MODULE_P20, 3}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM3_4_P21_0_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_4, {&MODULE_P21, 0}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM3_4_P22_8_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_4, {&MODULE_P22, 8}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM3_4_P34_1_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_4, {&MODULE_P34, 1}, (IfxGtm_ChXSel)12};
IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P00_6_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_5, {&MODULE_P00, 6}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P02_11_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_5, {&MODULE_P02,11}, (IfxGtm_ChXSel)12};
IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P11_10_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_5, {&MODULE_P11,10}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P13_0_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_5, {&MODULE_P13, 0}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P15_2_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_5, {&MODULE_P15, 2}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P20_9_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_5, {&MODULE_P20, 9}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P21_1_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_5, {&MODULE_P21, 1}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P22_9_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_5, {&MODULE_P22, 9}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P32_5_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_5, {&MODULE_P32, 5}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P34_2_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_5, {&MODULE_P34, 2}, (IfxGtm_ChXSel)13};
IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P00_7_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_6, {&MODULE_P00, 7}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P11_11_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_6, {&MODULE_P11,11}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P13_1_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_6, {&MODULE_P13, 1}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P15_3_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_6, {&MODULE_P15, 3}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P20_10_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_6, {&MODULE_P20,10}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P20_6_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_6, {&MODULE_P20, 6}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P22_10_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_6, {&MODULE_P22,10}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P32_6_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_6, {&MODULE_P32, 6}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P34_3_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_6, {&MODULE_P34, 3}, (IfxGtm_ChXSel)13};
IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P00_8_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_7, {&MODULE_P00, 8}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P11_12_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_7, {&MODULE_P11,12}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P13_2_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_7, {&MODULE_P13, 2}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P15_4_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_7, {&MODULE_P15, 4}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P20_11_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_7, {&MODULE_P20,11}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P20_7_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_7, {&MODULE_P20, 7}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P22_11_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_7, {&MODULE_P22,11}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P32_7_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_7, {&MODULE_P32, 7}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P34_4_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_7, {&MODULE_P34, 4}, (IfxGtm_ChXSel)12};
IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P00_9_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_0, {&MODULE_P00, 9}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P10_0_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_0, {&MODULE_P10, 0}, (IfxGtm_ChXSel)12};
IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P10_8_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_0, {&MODULE_P10, 8}, (IfxGtm_ChXSel)13};
IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P11_0_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_0, {&MODULE_P11, 0}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P12_0_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_0, {&MODULE_P12, 0}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P21_0_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_0, {&MODULE_P21, 0}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P32_7_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_0, {&MODULE_P32, 7}, (IfxGtm_ChXSel)15};
IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P00_10_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_1, {&MODULE_P00,10}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P11_1_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_1, {&MODULE_P11, 1}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P12_1_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_1, {&MODULE_P12, 1}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P21_1_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_1, {&MODULE_P21, 1}, (IfxGtm_ChXSel)13};
IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P32_5_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_1, {&MODULE_P32, 5}, (IfxGtm_ChXSel)14};
IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P00_11_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_2, {&MODULE_P00,11}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P02_9_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_2, {&MODULE_P02, 9}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P10_6_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_2, {&MODULE_P10, 6}, (IfxGtm_ChXSel)13};
IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P11_4_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_2, {&MODULE_P11, 4}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P21_6_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_2, {&MODULE_P21, 6}, (IfxGtm_ChXSel)12};
IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P23_6_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_2, {&MODULE_P23, 6}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P00_12_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_3, {&MODULE_P00,12}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P02_10_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_3, {&MODULE_P02,10}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P10_5_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_3, {&MODULE_P10, 5}, (IfxGtm_ChXSel)13};
IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P11_5_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_3, {&MODULE_P11, 5}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P21_7_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_3, {&MODULE_P21, 7}, (IfxGtm_ChXSel)12};
IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P23_7_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_3, {&MODULE_P23, 7}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P02_11_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_4, {&MODULE_P02,11}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P10_1_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_4, {&MODULE_P10, 1}, (IfxGtm_ChXSel)12};
IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P11_7_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_4, {&MODULE_P11, 7}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P20_1_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_4, {&MODULE_P20, 1}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P32_6_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_4, {&MODULE_P32, 6}, (IfxGtm_ChXSel)15};
IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P33_10_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_4, {&MODULE_P33,10}, (IfxGtm_ChXSel)14};
IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P33_4_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_4, {&MODULE_P33, 4}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P01_3_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_5, {&MODULE_P01, 3}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P10_2_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_5, {&MODULE_P10, 2}, (IfxGtm_ChXSel)12};
IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P11_8_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_5, {&MODULE_P11, 8}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P20_3_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_5, {&MODULE_P20, 3}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P33_14_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_5, {&MODULE_P33,14}, (IfxGtm_ChXSel)14};
IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P33_5_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_5, {&MODULE_P33, 5}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P01_4_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_6, {&MODULE_P01, 4}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P10_3_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_6, {&MODULE_P10, 3}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P11_13_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_6, {&MODULE_P11,13}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P33_15_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_6, {&MODULE_P33,15}, (IfxGtm_ChXSel)12};
IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P10_4_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_7, {&MODULE_P10, 4}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P11_14_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_7, {&MODULE_P11,14}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P11_15_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_7, {&MODULE_P11,15}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P14_7_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_7, {&MODULE_P14, 7}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P34_5_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_7, {&MODULE_P34, 5}, (IfxGtm_ChXSel)12};
IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P22_8_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_0, {&MODULE_P22, 8}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P33_14_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_0, {&MODULE_P33,14}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P22_9_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_1, {&MODULE_P22, 9}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P33_15_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_1, {&MODULE_P33,15}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P22_10_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_2, {&MODULE_P22,10}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P01_5_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_3, {&MODULE_P01, 5}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P22_11_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_3, {&MODULE_P22,11}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P34_1_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_3, {&MODULE_P34, 1}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P00_0_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_4, {&MODULE_P00, 0}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P21_2_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_4, {&MODULE_P21, 2}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P34_2_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_4, {&MODULE_P34, 2}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P00_1_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_5, {&MODULE_P00, 1}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P01_6_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_5, {&MODULE_P01, 6}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P21_3_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_5, {&MODULE_P21, 3}, (IfxGtm_ChXSel)12};
IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P32_5_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_5, {&MODULE_P32, 5}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P34_3_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_5, {&MODULE_P34, 3}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P00_2_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_6, {&MODULE_P00, 2}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P01_6_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_6, {&MODULE_P01, 6}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P21_4_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_6, {&MODULE_P21, 4}, (IfxGtm_ChXSel)12};
IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P32_6_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_6, {&MODULE_P32, 6}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P34_4_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_6, {&MODULE_P34, 4}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P00_3_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_7, {&MODULE_P00, 3}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P01_7_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_7, {&MODULE_P01, 7}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P21_5_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_7, {&MODULE_P21, 5}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P32_7_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_7, {&MODULE_P32, 7}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P34_5_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_7, {&MODULE_P34, 5}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM6_0_P20_6_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_0, {&MODULE_P20, 6}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM6_0_P23_7_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_0, {&MODULE_P23, 7}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM6_1_P20_7_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_1, {&MODULE_P20, 7}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM6_1_P23_6_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_1, {&MODULE_P23, 6}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM6_2_P20_8_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_2, {&MODULE_P20, 8}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM6_2_P23_5_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_2, {&MODULE_P23, 5}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM6_3_P20_9_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_3, {&MODULE_P20, 9}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM6_3_P23_4_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_3, {&MODULE_P23, 4}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM6_4_P00_4_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_4, {&MODULE_P00, 4}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM6_4_P23_3_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_4, {&MODULE_P23, 3}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM6_5_P23_2_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_5, {&MODULE_P23, 2}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM6_6_P23_1_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_6, {&MODULE_P23, 1}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM6_7_P23_0_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_7, {&MODULE_P23, 0}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM7_0_P22_3_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_0, {&MODULE_P22, 3}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM7_1_P22_2_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_1, {&MODULE_P22, 2}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM7_2_P22_1_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_2, {&MODULE_P22, 1}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM7_3_P12_0_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_3, {&MODULE_P12, 0}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM7_3_P22_0_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_3, {&MODULE_P22, 0}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM7_4_P12_1_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_4, {&MODULE_P12, 1}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM7_5_P11_0_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_5, {&MODULE_P11, 0}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM7_6_P11_1_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_6, {&MODULE_P11, 1}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM7_7_P11_4_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_7, {&MODULE_P11, 4}, (IfxGtm_ChXSel)1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT106_P10_4_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_e, 106, {&MODULE_P10, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT17_P00_8_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_e, 17, {&MODULE_P00, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT25_P33_3_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_e, 25, {&MODULE_P33, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT34_P33_12_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_e, 34, {&MODULE_P33,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT51_P21_0_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_f, 51, {&MODULE_P21, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT61_P20_3_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_f, 61, {&MODULE_P20, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT72_P15_1_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_e, 72, {&MODULE_P15, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT7_P02_7_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_e, 7, {&MODULE_P02, 7}, IfxPort_OutputIdx_alt1};
